app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    # @dogs = Dog.all
    @dogs = Dog.paginate page: params[:page], per_page: 5

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @dog = Dog.find(params[:id])

INSERT INTO "dogs" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Speck"], ["description", "Just a dog"], ["created_at", "2019-03-05 18:23:37.674425"], ["updated_at", "2019-03-05 18:23:37.674425"]]
---
  def create
    @dog = Dog.new(dog_params)
    respond_to do |format|
      if @dog.save

UPDATE "dogs" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["name", "Speck"], ["description", ""], ["updated_at", "2019-03-05 18:23:37.759881"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @dog.update(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]
---
  def destroy
    @dog.destroy

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_dog
      @dog = Dog.find(params[:id])